nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/sqi/processor/sqi_p32mz2048efh100.h
PLIB_INLINE_API bool PLIB_SQI_ExistsClockReady(SQI_MODULE_ID index)
{
     return SQI_ExistsClockReady_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_ClockEnable(SQI_MODULE_ID index)
{
     SQI_ClockEnable_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_ClockDisable(SQI_MODULE_ID index)
{
     SQI_ClockDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsClockControl(SQI_MODULE_ID index)
{
     return SQI_ExistsClockControl_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_RxBufferThresholdSet(SQI_MODULE_ID index, uint8_t threshold)
{
     SQI_RxBufferThresholdSet_Default(index, threshold);
}

PLIB_INLINE_API uint8_t PLIB_SQI_RxBufferThresholdGet(SQI_MODULE_ID index)
{
     return SQI_RxBufferThresholdGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsRxBufThreshold(SQI_MODULE_ID index)
{
     return SQI_ExistsRxBufThreshold_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_TxBufferThresholdSet(SQI_MODULE_ID index, uint8_t threshold)
{
     SQI_TxBufferThresholdSet_Default(index, threshold);
}

PLIB_INLINE_API uint8_t PLIB_SQI_TxBufferThresholdGet(SQI_MODULE_ID index)
{
     return SQI_TxBufferThresholdGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsTxBufThreshold(SQI_MODULE_ID index)
{
     return SQI_ExistsTxBufThreshold_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_RxBufferThresholdIntSet(SQI_MODULE_ID index, uint8_t threshold)
{
     SQI_RxBufferThresholdIntSet_Default(index, threshold);
}

PLIB_INLINE_API uint8_t PLIB_SQI_RxBufferThresholdIntGet(SQI_MODULE_ID index)
{
     return SQI_RxBufferThresholdIntGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsRxBufIntThreshold(SQI_MODULE_ID index)
{
     return SQI_ExistsRxBufIntThreshold_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_TxBufferThresholdIntSet(SQI_MODULE_ID index, uint8_t threshold)
{
     SQI_TxBufferThresholdIntSet_Default(index, threshold);
}

PLIB_INLINE_API uint8_t PLIB_SQI_TxBufferThresholdIntGet(SQI_MODULE_ID index)
{
     return SQI_TxBufferThresholdIntGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsTxBufIntThreshold(SQI_MODULE_ID index)
{
     return SQI_ExistsTxBufIntThreshold_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_InterruptEnable(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
     SQI_InterruptEnable_Default(index, interruptFlag);
}

PLIB_INLINE_API void PLIB_SQI_InterruptDisable(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
     SQI_InterruptDisable_Default(index, interruptFlag);
}

PLIB_INLINE_API void PLIB_SQI_InterruptDisableAll(SQI_MODULE_ID index)
{
     SQI_InterruptDisableAll_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_InterruptIsEnabled(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
     return SQI_InterruptIsEnabled_Default(index, interruptFlag);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsInterruptControl(SQI_MODULE_ID index)
{
     return SQI_ExistsInterruptControl_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_InterruptFlagGet(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
     return SQI_InterruptFlagGet_Default(index, interruptFlag);
}

PLIB_INLINE_API uint32_t PLIB_SQI_InterruptWordGet(SQI_MODULE_ID index)
{
     return SQI_InterruptWordGet_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_InterruptWordClear(SQI_MODULE_ID index, uint32_t flags)
{
     SQI_InterruptWordClear_Default(index, flags);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsInterruptStatus(SQI_MODULE_ID index)
{
     return SQI_ExistsInterruptStatus_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_TransmitData(SQI_MODULE_ID index, uint32_t data)
{
     SQI_TransmitData_Default(index, data);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsTxData(SQI_MODULE_ID index)
{
     return SQI_ExistsTxData_Default(index);
}

PLIB_INLINE_API uint32_t PLIB_SQI_ReceiveData(SQI_MODULE_ID index)
{
     return SQI_ReceiveData_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsRxData(SQI_MODULE_ID index)
{
     return SQI_ExistsRxData_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_SQI_TransmitBufferFreeSpaceGet(SQI_MODULE_ID index)
{
     return SQI_TransmitBufferFreeSpaceGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsTxBufferFree(SQI_MODULE_ID index)
{
     return SQI_ExistsTxBufferFree_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_SQI_NumberOfReceiveBufferReads(SQI_MODULE_ID index)
{
     return SQI_NumberOfReceiveBufferReads_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsRxBufferCount(SQI_MODULE_ID index)
{
     return SQI_ExistsRxBufferCount_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_SQI_ConBufWordsAvailable(SQI_MODULE_ID index)
{
     return SQI_ConBufWordsAvailable_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsConBufAvailable(SQI_MODULE_ID index)
{
     return SQI_ExistsConBufAvailable_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_SQI_CommandStatusGet(SQI_MODULE_ID index)
{
     return SQI_CommandStatusGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsCommandStatus(SQI_MODULE_ID index)
{
     return SQI_ExistsCommandStatus_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_DataLineStatus(SQI_MODULE_ID index, uint8_t dataPin)
{
     return SQI_DataLineStatus_Default(index, dataPin);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsDataPinStatus(SQI_MODULE_ID index)
{
     return SQI_ExistsDataPinStatus_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ReceiveBufferIsUnderrun(SQI_MODULE_ID index)
{
     return SQI_ReceiveBufferIsUnderrun_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsRxUnderRun(SQI_MODULE_ID index)
{
     return SQI_ExistsRxUnderRun_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_TransmitBufferHasOverflowed(SQI_MODULE_ID index)
{
     return SQI_TransmitBufferHasOverflowed_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsTxOverFlow(SQI_MODULE_ID index)
{
     return SQI_ExistsTxOverFlow_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_DMAEnable(SQI_MODULE_ID index)
{
     SQI_DMAEnable_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_DMADisable(SQI_MODULE_ID index)
{
     SQI_DMADisable_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_DMAIsEnabled(SQI_MODULE_ID index)
{
     return SQI_DMAIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsDmaEnable(SQI_MODULE_ID index)
{
     return SQI_ExistsDmaEnable_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_DMABDPollEnable(SQI_MODULE_ID index)
{
     SQI_DMABDPollEnable_Default(index);
}

